# 메뉴 주문 시스템
# 1.무한 루프 
#   1) 메뉴를 출력
#   2) 메뉴 번호를 입력 받기
#   3) 선택 받은 번호의 가격을 누적 계산
#   4) 0이 입력 될 때 까지 반복
# 2. 0이 입력 되면 총 금액 출력 및 반복 종료

# 총액 변수 초기화
total = 0

# 무한 루프 while문
while True:
    print("--- 메뉴 ---")               # 메뉴 출력
    print("1. 아메리카노 (4000원)")
    print("2. 카페라떼 (4500원)")
    print("3. 녹차 (3500원)")
    print("0. 주문 완료")

    order = int(input())  # 주문 입력 받기

    if order == 1:                       # 주문 받은 메뉴에 금액에 따라 안내멘트 및 금액 누적 계산
        print("아메리카노를 추가했습니다.")
        total += 4000  
    elif order == 2:
        print("카페라떼를 추가했습니다.")
        total += 4500
    elif order == 3:
        print("녹차를 추가했습니다.")
        total += 3500
    elif order == 0:                       # 0을 입력 받았을 경우
        print(f"총 주문 금액: {total}원")     # 총액 출력
        break                              # 반복 종료
